<template>
  <CompetitionSection>
    <h2 id="about-orkse">
      О предмете «Основы Религиозной Культуры и Светской Этики»
    </h2>
    <div class="video video-right" v-if="addressee !== 'children'">
      <video-player>
        <video-skin>
          <video
            playsinline
            controls
            src="https://s3.regru.cloud/opk-info/videos/Общая информация о предмете ОРКСЭ_720p.mp4"
          ></video>
        </video-skin>
      </video-player>
    </div>

    <p v-if="addressee === 'parents'">
      Начиная с 2006 года, в некоторых регионах Российской Федерации начали в
      тестовом режиме внедрять в учебную программу такой предмет как
      «Православная Культура» для учеников 2-11 классов.
    </p>
    <p v-if="addressee === 'parents'">
      Программа постепенно развивалась, были написаны несколько учебников, шла
      полноценная совместная работа между Русской Православной Церковью и
      Министерством Образования Российской Федерации и к 2012 году было
      сформировано уже полноценное понимание того, как это должно быть устроено.
      Такой формат существует и сейчас, с небольшими изменениями.
    </p>
    <p>
      В образовательную программу 4-х классов входит
      <strong>обязательный</strong> предмет под названием
      <strong>«Основы Религиозной Культуры и Светской Этики»</strong>, уроки по
      которому проходят раз в неделю. Всего <strong>32 урока</strong> за год.
    </p>
    <p><strong>Урок делиться на 6 модулей:</strong></p>
    <UIList :type="'ol'">
      <li>«Основы православной культуры»;</li>
      <li>«Основы исламской культуры»;</li>
      <li>«Основы буддийской культуры»;</li>
      <li>«Основы иудейской культуры»;</li>
      <li>«Основы религиозных культур народов России»;</li>
      <li>«Основы светской этики».</li>
    </UIList>
    <p v-if="addressee !== 'children'">
      Родители (или законные представители) перед началом учебного
      <strong>обязаны выбирать</strong> один из модулей, который будет изучать
      их ребёнок.
    </p>
  </CompetitionSection>
</template>

<script setup lang="ts">
  interface Props {
    addressee: 'children' | 'teachers' | 'parents';
  }

  const props = defineProps<Props>();
</script>

<style scoped lang="scss"></style>
