<template>
  <CompetitionSection>
    <h2>Законодательство</h2>
    <p>
      В данном разделе собраны основные нормативные правовые акты Российской
      Федерации, прямо или косвенно регламентирующие преподавание комплексного
      учебного курса «Основы религиозных культур и светской этики» (ОРКСЭ), а
      также модуля «Основы православной культуры» (ОПК).
    </p>
    <h3>
      <strong
        >1. Федеральный Закон №125, от 26.09.1997 «О свободе совести и о
        религиозных объединениях»</strong
      >
    </h3>
    <p>
      Данный закон регулирует отношения между государством и религиозными
      объединениями, закладывая правовые основы для изучения религиозных культур
      в системе образования.
    </p>
    <blockquote>
      Российская Федерация <strong>является светским государством</strong>,
      признавая
      <strong
        >особую роль православия в истории России, в становлении и развитии ее
        духовности и культуры</strong
      >
    </blockquote>
    <p>
      <a
        href="https://www.consultant.ru/document/cons_doc_LAW_16218/"
        target="blanck"
        >Ссылка на полный текст закона (consultant.ru)</a
      >
    </p>
    <h3>
      <strong
        >2. Федеральный Закон №273, от 29.12.2012 «Об образовании в Российской
        Федерации»</strong
      >
    </h3>
    <p>
      Статья 87 данного закона посвящена «Особенностям изучения основ
      духовно-нравственной культуры народов Российской Федерации. Особенностям
      получения теологического и религиозного образования».
    </p>
    <blockquote>
      Ч.1.: В основные образовательные программы могут быть включены, <...>
      учебные предметы, курсы, дисциплины (модули), направленные на получение
      обучающимися знаний об
      <strong
        >основах духовно-нравственной культуры народов Российской Федерации, о
        нравственных принципах, об исторических и культурных традициях мировой
        религии</strong
      >.
    </blockquote>
    <p>
      <a
        href="https://www.consultant.ru/document/cons_doc_LAW_140174/"
        target="blanck"
        >Ссылка на полный текст закона (все направления образовательной
        деятельности)</a
      >
    </p>
    <p>
      <a
        href="https://www.consultant.ru/document/cons_doc_LAW_140174/0de7845187501423002e9572e4903056b41b3f7f/"
        target="blanck"
        >Ссылка на статью 87 (духовно-нравственное просвещение)</a
      >
    </p>
    <h3>
      <strong
        >3. Указ Президента РФ №809, от 09.11.2022 «Об утверждении Основ
        государственной политики по сохранению и укреплению традиционных
        российских духовно-нравственных ценностей»</strong
      >
    </h3>
    <p>
      Документ определяет систему целей, задач и инструментов реализации
      стратегического национального приоритета в части защиты традиционных
      духовно-нравственных ценностей.
    </p>
    <blockquote>
      П.5.: К традиционным ценностям относятся жизнь, достоинство, права и
      свободы человека, патриотизм, гражданственность, служение Отечеству и
      ответственность за его судьбу, высокие нравственные идеалы, крепкая семья,
      созидательный труд, приоритет духовного над материальным, гуманизм,
      милосердие, справедливость, коллективизм, взаимопомощь и взаимоуважение,
      историческая память и преемственность поколений, единство народов России.
    </blockquote>
    <blockquote>
      П.6.: Христианство, ислам, буддизм, иудаизм и другие религии, являющиеся
      неотъемлемой частью российского исторического и духовного наследия,
      оказали значительное влияние на формирование традиционных ценностей, общих
      для верующих и неверующих граждан.
      <strong
        >Особая роль в становлении и укреплении традиционных ценностей
        принадлежит православию.</strong
      >
    </blockquote>
    <p>
      <a
        href="http://www.kremlin.ru/acts/bank/48502?erid=LjN8K8S"
        target="blanck"
        >Ссылка на указ Президента РФ № 809 (kremlin.ru)</a
      >
    </p>
    <h3>
      <strong>4. Иные документы и дополнительные материалы</strong>
    </h3>
    <p>
      С другими нормативными актами, методическими рекомендациями и
      разъяснениями можно ознакомиться на официальном сайте Синодального отдела
      религиозного образования и катехизации Русской Православной Церкви в
      разделе «ОПК» (подраздел «Документы»).
    </p>
    <p>
      <a href="https://pravobraz.ru/napravleniya/opk/" target="blanck"
        >Ссылка на раздел «ОПК» на сайте pravobraz.ru</a
      >
    </p>
  </CompetitionSection>
</template>

<script setup lang="ts"></script>

<style scoped lang="scss">
  a {
    color: var(--col-text);
  }
</style>
