<template>
  <div class="mainpage">
    <h2>Об отделе</h2>
    <p>
      В структуре каждой епархии Русской Православной Церкви существуют
      епархиальные отделы, призванные координировать церковную деятельность в
      различных направлениях. Одним из ключевых является Епархиальный отдел
      религиозного образования и катехизации (ЕОРОиК).
    </p>
    <p>
      Это структурное подразделение, действующее под непосредственным
      руководством правящего архиерея, призвано быть связующим звеном между
      церковным образованием, государственными образовательными стандартами и
      запросами общества. Его работа направлена на духовно-нравственное
      становление личности, воцерковление новоначальных и профессиональную
      подготовку педагогов.
    </p>
  </div>
</template>

<script setup lang="ts"></script>

<style scoped lang="scss">
  .mainpage {
    // width: 1600px;
    // margin: 0 auto;
  }
</style>
