<template>
  <div>
    <UIMenu :menu />
    <h2 id="base-info">Класс Духовного Пения: развиваемся вместе</h2>
    <div class="video">
      <video-player>
        <video-skin>
          <video
            playsinline
            controls
            src="https://s3.regru.cloud/opk-info/videos/Общая информация о КДП_360p.mp4"
          ></video>
        </video-skin>
      </video-player>
    </div>

    <p>
      Возрождение певческих хоровых традиций в храме — актуальная задача,
      которая стоит перед всеми, кто любит православное богослужение. Обучение
      как можно большего количества детей культуре богослужебного пения — это не
      только будущее для профессиональных хоров, но и шаг к возрождению
      народного пения в храме. Исходя из этих соображений, в Горловской епархии
      были открыты классы духовного пения.
    </p>
    <figure class="photo right">
      <NuxtImg
        src="https://s3.regru.cloud/opk-info/kdp/kdp1.webp"
        alt="photo"
      />
    </figure>

    <p>
      <strong>Класс Духовного Пения в Горловке</strong> — это уникальная
      образовательная программа, которая сочетает музыкальное обучение с
      приобщением к православной традиции.
    </p>
    <h2 id="history">История создания: как всё начиналось</h2>
    <figure class="photo">
      <NuxtImg
        src="https://s3.regru.cloud/opk-info/kdp/kdp2.webp"
        alt="photo"
      />
    </figure>

    <p>
      Идея создания специализированного класса для подготовки певчих возникла
      <strong>в 2011 году</strong>. Её инициатором выступила
      <strong>Наталья Вадимовна Сергиенко</strong>, директор Школы искусств № 1.
      Получив благословение
      <strong>Высокопреосвященнейшего владыки Митрофана</strong>, организаторы
      приступили к формированию преподавательского коллектива. В первую очередь
      искали профессионалов, уже имеющих опыт клиросного пения.
    </p>
    <figure class="photo right">
      <NuxtImg
        src="https://s3.regru.cloud/opk-info/kdp/kdp3.webp"
        alt="photo"
      />
    </figure>

    <p>
      Параллельно шёл набор учеников. Первыми воспитанниками стали 25 детей из
      воскресных школ Горловки. Костяк коллектива сложился благодаря тесному
      сотрудничеству с епархией и методическими объединениями преподавателей
      воскресных школ.
    </p>
    <figure class="photo">
      <NuxtImg
        src="https://s3.regru.cloud/opk-info/kdp/kdp4.webp"
        alt="photo"
      />
    </figure>
    <p>
      <strong>1 января 2015 года</strong> класс официально открыл свои двери. За
      первый год количество учащихся выросло почти вдвое — с 25 до 48 человек.
      Сегодня, после переезда в музыкальную школу № 2, класс духовного пения
      стал одним из отделений хорового пения, что позволило расширить учебные
      программы и давать детям полноценное комплексное образование.
    </p>
    <h2 id="originality">Чем уникален класс духовного пения?</h2>
    <figure class="photo right">
      <NuxtImg
        src="https://s3.regru.cloud/opk-info/kdp/kdp5.webp"
        alt="photo"
      />
    </figure>
    <p>
      Главная цель проекта — не просто искать готовых певчих для храмов, а
      воспитывать их с первого класса музыкальной школы. Это, по сути, филиал
      музыкальной школы для будущих церковных певцов.
    </p>
    <p><strong>Ключевые отличия от обычной музыкальной школы:</strong></p>
    <UIList>
      <li>
        <strong>Специализированный репертуар.</strong> Дети постигают
        музыкальную премудрость на примерах церковных песнопений. На уроках
        сольфеджио, вокала и хора изучаются стили и жанры духовной музыки,
        творчество композиторов, писавших для Церкви (Д.С. Бортнянский, П.И.
        Чайковский, А.С. Ведель).
      </li>
      <figure class="photo">
        <NuxtImg
          src="https://s3.regru.cloud/opk-info/kdp/kdp6.webp"
          alt="photo"
        />
      </figure>
      <li>
        <strong
          >История христианской культуры и символизм Божественной
          Литургии.</strong
        >
        В программу включен специальный курс, дающий глубокие знания о
        традициях, символах и уставе богослужения.
      </li>
      <li>
        <strong>Клиросная практика.</strong> Ученики уже во время учебы могут
        нести послушание в храмах, применяя полученные знания на практике.
        Старшие дети поют в церковных хорах Горловки. Это уникальная возможность
        профессионального роста, которой нет в обычных музыкальных школах.
      </li>
    </UIList>
    <h2 id="education">Учебный процесс: знания и дисциплина</h2>
    <figure class="photo right">
      <NuxtImg
        src="https://s3.regru.cloud/opk-info/kdp/kdp7.webp"
        alt="photo"
      />
    </figure>
    <p>
      Сегодня ученики класса духовного пения осваивают
      <strong
        >полный комплекс дисциплин, обязательных для музыкальной школы</strong
      >. Это групповые занятия — хоровое пение, сольфеджио, музыкальная
      литература — и индивидуальные уроки по постановке голоса и фортепиано.
    </p>
    <figure class="photo">
      <NuxtImg
        src="https://s3.regru.cloud/opk-info/kdp/kdp8.webp"
        alt="photo"
      />
    </figure>
    <p>
      Важнейший аспект работы класса — <strong>воспитание личности</strong>.
      Наблюдения педагогов показывают, что воцерковлённые дети отличаются
      большей старательностью, сознательностью и добросовестностью в учёбе.
      Молитва перед занятиями и участие в богослужениях накладывают отпечаток на
      поведение, а другие ученики, в свою очередь, тянутся за ними.
    </p>
    <!-- <iframe
      width="100%"
      style="
        position: relative;
        z-index: 2;
        display: block;
        float: right;
        width: 700px;
        max-width: 100%;
        height: 400px;
        margin: 0 0.5em 0.5em 1.5em;
        overflow: hidden;
        border: 4px solid var(--accent);
        border-radius: 10px;
      "
      src="https://rutube.ru/play/embed/aa0ceed3a9ac1aca833708559981efea/?skinColor=070835"
      allow="clipboard-write; autoplay"
      allowFullScreen
    ></iframe> -->
    <div class="video right">
      <iframe
        width="100%"
        style="
          width: 700px;
          max-width: 100%;
          height: 400px;
          overflow: hidden;
          border: 4px solid var(--accent);
          border-radius: 10px;
        "
        src="https://rutube.ru/play/embed/aa0ceed3a9ac1aca833708559981efea/?skinColor=070835"
        allow="clipboard-write; autoplay"
        allowFullScreen
      ></iframe>
    </div>
    <p>
      Класс духовного пения существует
      <strong>при активной поддержке Горловской епархии</strong>. Владыка
      Митрофан уделяет внимание развитию класса и организует клиросную практику
      для детей по выходным.
    </p>
    <p>
      Большую роль играет и <strong>родительская поддержка</strong>. Мамы и папы
      активно следят за посещаемостью, помогают в организации мероприятий и
      заинтересованы в успехах своих детей.
    </p>
    <p>
      В классе духовного пения дети смогут получить качественное музыкальное
      образование, а также глубже узнать культуру своего народа, православную
      традицию.
    </p>
    <h2 id="docs">Итоги обучения</h2>
    <figure class="photo">
      <NuxtImg
        src="https://s3.regru.cloud/opk-info/kdp/kdp9.webp"
        alt="photo"
      />
    </figure>
    <p>
      <strong
        >По окончании полного курса обучения ваш ребенок получит два
        документа:</strong
      >
    </p>
    <UIList>
      <li>
        <strong>Свидетельство об окончании музыкальной школы</strong> —
        государственный документ о дополнительном музыкальном образовании,
        котирующийся во всех учебных заведениях нашей страны.
      </li>
      <li>
        <strong
          >Сертификат о прохождении богослужебно-певческой практики</strong
        >
        — церковный документ, подтверждающий подготовку ребенка как певчего, с
        опытом хорового пения на клиросе в храме.
      </li>
    </UIList>
    <h2 id="contacts">Контакты</h2>
    <p>
      Если вы хотите, чтобы ваш ребёнок приобщился к православной культуре,
      получил качественное музыкальное образование и нашёл друзей в атмосфере
      добра и творчества — класс духовного пения музыкальной школы № 2
      <strong>ждёт своих новых учеников</strong>.
    </p>
    <p style="text-align: center">
      На <strong>2026/2027</strong> учебный год прослушивания будут проходить
      <br />
      <strong style="font-size: 2em"
        >16, 17 и 18 августа c 10:00 до 12:00</strong
      >
      <br />
      по адресу:
      <span style="font-style: italic"
        >ул. Вострухина, 2 (Николаевский архиерейский собор)</span
      >
    </p>
    <p>Обучение в классе духовного пения <strong>бесплатное</strong>.</p>

    <p></p>
    <UIList>
      <li>
        <strong>Марковская Марина Викторовна</strong> (регент хора) —
        <a href="tel:+79495391798">+7 (949) 539-17-98</a>
      </li>
      <li>
        <strong>Тарасюк Елена Викторовна</strong> (классный руководитель) —
        <a href="tel:+79493675034">+7 (949) 367-50-34</a>
      </li>
    </UIList>
  </div>
</template>

<script setup lang="ts">
  const menu = [
    {
      name: 'Класс Духовного Пения',
      id: 'base-info',
      lvl: 1,
    },
    {
      name: 'История создания',
      id: 'history',
      lvl: 1,
    },
    {
      name: 'Уникальность Класса Духовного Пения',
      id: 'originality',
      lvl: 1,
    },
    {
      name: 'Учебный процесс',
      id: 'education',
      lvl: 1,
    },
    {
      name: 'Итоги обучения',
      id: 'docs',
      lvl: 1,
    },
    {
      name: 'Контакты',
      id: 'contacts',
      lvl: 1,
    },
  ];
</script>

<style scoped lang="scss">
  .photo {
    display: block;
    float: left;
    width: 30%;
    margin: 0 1.5em 0.5em 0.5em;
    overflow: hidden;
    border: 4px solid var(--accent);
    border-radius: 10px;
    & img {
      display: block;
      width: 100%;
    }
  }
  .right {
    float: right;
    margin: 0 0.5em 0.5em 1.5em;
  }

  @media (width <= 768px) {
    .photo {
      float: none;
      width: 100%;
      margin: 0 0 1em;
    }
    .right {
      float: none;
      margin: 0 0 1em;
    }
  }
  .video {
    width: 35%;
  }

  @media (width <= 1200px) {
    .video {
      width: 40%;
    }
  }

  @media (width <= 768px) {
    .video {
      width: 100%;
    }
  }
</style>
