<template>
  <div>
    <UIMenu :menu />
    <OPKMeeting :is-teachers="true" />
    <CompetitionSection>
      <h2 id="skillup">Повышение квалификации</h2>
      <p>Уважаемые учителя!</p>
      <p>
        Преподавание модуля «Основы Православной Культуры» в рамках курса ОРКСЭ
        требует от педагога не только профессиональных компетенций, но и
        глубокого понимания традиционных духовно-нравственных ценностей.
      </p>
      <h3 id="skillup-donriro">
        <strong>Донецкий Республиканский Институте Развития Образования</strong>
      </h3>
      <p>
        С 16 июня по 29 августа 2025 года 531 учитель Донецкой Народной
        Республики успешно прошёл курсы повышения квалификации в Донецком
        республиканском институте развития образования совместно с духовенством
        Донецкой и Горловской Епархий. Программа вызвала живой отклик и
        подтвердила высокую востребованность качественных учебно-методических
        материалов.
      </p>
      <p>
        Чтобы помочь каждому педагогу систематизировать знания и подготовиться к
        аттестации (или к повторному прохождению курсов), мы подготовили сборник
        вопросов и ответов.
      </p>
      <UIDocumentWrap>
        <UIDocumentCard
          :size="'1.02 Mb'"
          href="https://s3.regru.cloud/opk-info/docs/Билеты_и_ответы_к_зачету_по_модулю_ДонРИРО.pdf"
          >Билеты и ответы к зачету по модулю ДонРИРО</UIDocumentCard
        >
      </UIDocumentWrap>
      <h3 id="skillup-clever">
        <strong
          >«Клевер Лаборатория»: Всероссийский центр профессионального роста
          педагога</strong
        >
      </h3>
      <p>
        Если вы хотите расширить свои профессиональные горизонты и познакомиться
        с передовым опытом коллег из других регионов, ваш надежный помощник —
        «Клевер Лаборатория».
      </p>
      <p>
        Это не просто сайт с материалами, а масштабный образовательный проект,
        созданный по благословению Святейшего Патриарха Синодальным отделом
        религиозного образования и катехизации Русской Православной Церкви при
        поддержке Министерства просвещения РФ. Это первая общероссийская
        платформа, которая создала единый профессиональный стандарт для
        учителей, ведущих модуль ОПК. Отметим, что Донецкая Народная Республика
        — в числе самых активных участников сообщества: по итогам одного из
        семестов наш регион вошёл в топ-5 по числу слушателей курсов.
      </p>
      <p>
        <strong>Почему стоит заглянуть на «Клевер»? Ваши возможности:</strong>
      </p>
      <UIList>
        <li>
          <strong>Станьте слушателем актуальных курсов.</strong> Платформа
          предлагает несколько программ, посвященных ОПК. Например, курс
          «Методика преподавания модуля “Основы православной культуры”» объёмом
          72 часа и интенсив «Православная культура в начальной школе» (24
          часа). Обучение проходит в удобном онлайн-формате: живые и
          предзаписанные вебинары, доступ к методическим материалам.
        </li>
        <li>
          <strong>Вдохновляйтесь на новые открытия.</strong> Педагоги, прошедшие
          обучение, делятся, что курсы дают им «конкретные инструменты, которые
          можно сразу применять в образовательной практике». Вы освоите
          технологии коллективной рефлексии, проектной деятельности и приёмы
          обсуждения ценностных тем, которые сделают ваши уроки живыми и
          запоминающимися для детей.
        </li>
        <li>
          <strong>Получите официальный документ.</strong> После успешного
          завершения обучения выдаётся удостоверение о повышении квалификации
          государственного образца, которое подтвердит ваши компетенции.
          Платформа имеет бессрочную лицензию на образовательную деятельность.
        </li>
        <li>
          <strong>Обучайтесь бесплатно.</strong> Это особенно важно для
          бюджетной сферы. «Клевер Лаборатория» — некоммерческий проект,
          существующий на благотворительные пожертвования. Обучение для
          педагогов полностью бесплатное.
        </li>
        <li>
          <strong>Станьте частью профессионального сообщества.</strong> «Клевер»
          объединяет единомышленников со всей России, здесь можно обмениваться
          опытом, получать консультационную и методическую поддержку, а также
          отслеживать расписание будущих вебинаров и семестров.
        </li>
      </UIList>
      <a
        href="https://clever-lab.pro/course/index.php?categoryid=10"
        class="organization-competition clever"
        target="_blank"
        rel="noopener noreferrer"
      >
        <div>«Клевер Лаборатория»</div>
        <div>
          <NuxtImg src="/logo_clever.webp" alt="«Клевер Лаборатория»" />
        </div>
      </a>
    </CompetitionSection>
    <OPKLessons :addressee="'teachers'" />
    <OPKLaws />
  </div>
</template>

<script setup lang="ts">
  const menu = [
    { name: 'Родительское собрание', id: 'meeting', lvl: 1 },
    { name: '1. Подготовка и содержание собрания', id: 'meeting-1', lvl: 2 },
    {
      name: '2. Процедура выбора и документальное оформление',
      id: 'meeting-2',
      lvl: 2,
    },
    {
      name: '3. Составление итоговых документов класса',
      id: 'meeting-3',
      lvl: 2,
    },
    { name: '4. Утверждение и передача данных', id: 'meeting-4', lvl: 2 },
    { name: 'Дополнительные ресурсы', id: 'meeting-resourses', lvl: 2 },
    { name: 'Повышение квалификации', id: 'skillup', lvl: 1 },
    { name: 'ДонРИРО', id: 'skillup-donriro', lvl: 2 },
    { name: 'Клевер Лаборатория', id: 'skillup-clever', lvl: 2 },
    { name: 'Материалы к урокам', id: 'lessons', lvl: 1 },
    { name: 'Законодательство', id: 'laws', lvl: 1 },
    { name: 'Федеральный Закон №125, от 26.09.1997', id: 'laws-1', lvl: 2 },
    { name: 'Федеральный Закон №273, от 29.12.2012', id: 'laws-2', lvl: 2 },
    { name: 'Указ Президента РФ №809, от 09.11.2022', id: 'laws-3', lvl: 2 },
    { name: 'Иные документы и дополнительные материалы', id: 'laws-4', lvl: 2 },
  ];
</script>

<style scoped lang="scss">
  .clever {
    --accent: #66c2a9;
  }
</style>
