<template>
  <div>
    <UIMenu :menu />
    <CompetitionSection>
      <h2 id="about-orkse">
        О предмете «Основы Религиозной Культуры и Светской Этики»
      </h2>
      <div class="video video-right">
        <video-player>
          <video-skin>
            <video
              playsinline
              controls
              src="https://s3.regru.cloud/opk-info/videos/Общая информация о предмете ОРКСЭ_720p.mp4"
            ></video>
          </video-skin>
        </video-player>
      </div>

      <p>
        Начиная с 2006 года, в некоторых регионах Российской Федерации начали в
        тестовом режиме внедрять в учебную программу такой предмет как
        «Православная Культура» для учеников 2-11 классов.
      </p>
      <p>
        Программа постепенно развивалась, были написаны несколько учебников, шла
        полноценная совместная работа между Русской Православной Церковью и
        Министерством Образования Российской Федерации и к 2012 году было
        сформировано уже полноценное понимание того, как это должно быть
        устроено. Такой формат существует и сейчас, с небольшими изменениями.
      </p>
      <p>
        В образовательную программу 4-х классов входит
        <strong>обязательный</strong> предмет под названием
        <strong>«Основы Религиозной Культуры и Светской Этики»</strong>, уроки
        по которому проходят раз в неделю. Всего <strong>32 урока</strong> за
        год.
      </p>
      <p><strong>Урок делиться на 6 модулей:</strong></p>
      <UIList :type="'ol'">
        <li>«Основы православной культуры»;</li>
        <li>«Основы исламской культуры»;</li>
        <li>«Основы буддийской культуры»;</li>
        <li>«Основы иудейской культуры»;</li>
        <li>«Основы религиозных культур народов России»;</li>
        <li>«Основы светской этики».</li>
      </UIList>
      <p>
        Родители (или законные представители) перед началом учебного
        <strong>обязаны выбирать</strong> один из модулей, который будет изучать
        их ребёнок.
      </p>
    </CompetitionSection>
    <CompetitionSection>
      <h2 id="about-opk">Выбор модуля «Основы православной культуры»</h2>
      <div class="video">
        <video-player>
          <video-skin>
            <video
              playsinline
              controls
              src="https://s3.regru.cloud/opk-info/videos/Краткий обзор тем модуля ОПК_720p.mp4"
            ></video>
          </video-skin>
        </video-player>
      </div>

      <p>
        <strong
          >Православная вера является культурообразующей религией для нашего
          народа и нашего государства.</strong
        >
        Это факт, с которым сложно спорить, поскольку русская культура пестрит
        христианскими образами. Выбор модуля комплексного учебного курса «Основы
        религиозных культур и светской этики» (ОРКСЭ) — ответственное решение
        для родителей и педагогов. Модуль «Основы православной культуры» (ОПК)
        часто воспринимается узко-религиозно, однако его значение выходит далеко
        за рамки вероучения.
        <strong
          >Православие является культурообразующей и государствообразующей
          религией для России.</strong
        >
        Это исторический факт, подтвержденный тысячелетней традицией,
        искусством, литературой и самой логикой развития нашего Отечества.
      </p>
      <p>
        С момента Крещения Руси (988 г.) Православие стало не просто религией, а
        <strong>духовно-нравственным стержнем общества</strong>. Характер,
        мировоззрение, этика и даже быт русского народа формировались на базе
        православной веры. Христианская этика веками регулировала человеческие
        отношения в семье, в общественных местах и на государственной службе.
        Даже становление российского законодательства и дипломатических традиций
        проходило под заметным влиянием Русской Православной Церкви.
      </p>
      <p>
        Вся русская культура буквально пронизана православными образами и
        смыслами.
        <strong
          >Изучение этого модуля дает ребенку ключи к пониманию великого
          наследия</strong
        >, которое он будет проходить в старших классах и во взрослой жизни.
      </p>
      <h3 id="about-opk-1"><strong>Живопись</strong></h3>
      <p>
        Шедевры Андрея Рублева, Феофана Грека, а также позднейшая религиозная
        живопись Александра Иванова или Василия Перова — это визуальная
        проповедь и отражение национальной души. Без знания ОПК эти картины
        остаются лишь формальными изображениями.
      </p>
      <div class="gallery">
        <figure>
          <NuxtImg src="https://s3.regru.cloud/opk-info/images/info_01.jpg" />
          <figcaption>В.М. Васнецов «Единородный сын Слово Божие»</figcaption>
        </figure>
        <figure>
          <NuxtImg src="https://s3.regru.cloud/opk-info/images/info_02.jpg" />
          <figcaption>Н.Д. Лосев «Блудный сын»</figcaption>
        </figure>
        <figure>
          <NuxtImg src="https://s3.regru.cloud/opk-info/images/info_03.jpg" />
          <figcaption>А.А. Иванов «Явление Христа народу»</figcaption>
        </figure>
        <figure>
          <NuxtImg src="https://s3.regru.cloud/opk-info/images/info_04.jpg" />
          <figcaption>Икона «Троицы» Андрея Рублёва</figcaption>
        </figure>
      </div>
      <h3 id="about-opk-2"><strong>Литература</strong></h3>
      <p>
        Русская литература, от древнерусских летописей и «Слова о законе и
        благодати» до «Преступления и наказания» Ф.М. Достоевского и «Войны и
        мира» Л.Н. Толстого, немыслима без православной этики. Поиск
        нравственной опоры, тема греха и покаяния, проблема гордости и смирения
        — это красные нити произведений Пушкина, Лермонтова, Гоголя, Чехова. Не
        зная основ православной культуры, читатель обедняет свое восприятие
        классики.
      </p>
      <h3 id="about-opk-3"><strong>Архитектура</strong></h3>
      <p>
        Целые города (Москва, Санкт-Петербург, Великий Новгород, Псков, Суздаль,
        Ростов Великий) являются мировым достоянием именно благодаря своим
        храмам, монастырям и кремлям. Архитектурный облик России — это купола и
        кресты.
      </p>
      <div class="gallery">
        <figure>
          <NuxtImg src="https://s3.regru.cloud/opk-info/images/info_05.jpeg" />
          <figcaption>Санкт-Петербург</figcaption>
        </figure>
        <figure>
          <NuxtImg src="https://s3.regru.cloud/opk-info/images/info_06.jpg" />
          <figcaption>Великий Новгород</figcaption>
        </figure>
        <figure>
          <NuxtImg src="https://s3.regru.cloud/opk-info/images/info_07.jpg" />
          <figcaption>Елец</figcaption>
        </figure>
        <figure>
          <NuxtImg src="https://s3.regru.cloud/opk-info/images/info_08.jpg" />
          <figcaption>Суздаль</figcaption>
        </figure>
      </div>
      <h3 id="about-opk-4"><strong>Язык и повседневность</strong></h3>
      <p>
        Даже светский человек, сам того не замечая, говорит на языке, созданном
        православной традицией. Разберем одно предложение:
      </p>
      <blockquote>
        «Богдан идет в воскресенье
        <NuxtTime :datetime="wd" year="numeric" month="long" day="numeric" />
        года по Богородской улице города Троицка и слышит колокольный звон
        Тихвинской церкви, подает монетку бездомному, сидящему около храма, и
        слышит “спасибо”»
      </blockquote>
      <p>
        В этих словах нет никакого богословия, уроков Закона Божия, уроков
        Священного Писания. Это обычное предложение. Но какими смыслами оно на
        полнено?
      </p>
      <UIList>
        <li>
          <strong>Имя Богдан</strong> — славянское имя со смыслом «Богом данный»
          или «Богом дарованный».
        </li>
        <li>
          <strong>Воскресенье</strong> — день недели, в который вспоминаем
          Воскресшего Христа.
        </li>
        <li>
          <strong><NuxtTime :datetime="wd" year="numeric" /></strong> — год от
          Рождества Христова.
        </li>
        <li>
          <strong>Богородицкая улица и город Троицк</strong> — огромная часть
          городов, сёл, улиц названы в честь святых. В данном случае в честь
          Пресвятой Богородицы и Святой Троицы.
        </li>
        <li>
          <strong>Подаёт монетку</strong> — то есть сотворил дело милосердия.
          Милосердие, как одна из христианских добродетелей, на которой воспитан
          наш народ.
        </li>
        <li>
          <strong>Спасибо</strong> — слово, являющееся сокращением от пожелания
          «Спаси Бог».
        </li>
      </UIList>
      <p>
        Без понимания этих основ многие явления русской культуры остаются для
        ребенка немыми и чуждыми.
      </p>
      <h3 id="about-opk-5">
        <strong>Нравственный ориентир в современном мире</strong>
      </h3>
      <p>
        Современное информационное пространство проецирует огромное количество
        негативных и деструктивных образов. Ребенку трудно найти подлинные
        героические и чистые примеры для подражания. Родители и педагоги несут
        ответственность за то, какие ценности усвоит будущий активный член
        общества.
      </p>
      <p>
        Модуль ОПК предлагает проверенный веками фундамент для
        духовно-нравственного развития через образы русских святых — реальных
        исторических личностей, чья жизнь является высоким примером:
      </p>
      <UIList>
        <li>
          <strong>Святой благоверный князь Александр Невский</strong>: Образ
          жертвенного служения Отечеству, защиты веры и народа, дипломатического
          ума и воинской доблести.
        </li>
        <li>
          <strong>Преподобный Серафим Саровский</strong>: Пример всеобъемлющей
          любви, кротости, радости («Христос Воскресе, радость моя») и доброго
          отношения к каждому человеку вне зависимости от его социального
          статуса.
        </li>
        <li>
          <strong>Святые Петр и Феврония Муромские</strong>: Идеал семейной
          верности, любви и взаимного уважения.
        </li>
      </UIList>
      <h3 id="about-opk-6"><strong>Что дает ребенку изучение ОПК?</strong></h3>
      <p>Исходя из сказанного, выгода от выбора модуля ОПК очевидна:</p>
      <UIList :type="'ol'">
        <li>
          <strong>Повышение качества образования.</strong> Ребенок приходит на
          уроки литературы, истории, мировой художественной культуры в старших
          классах уже подготовленным. Для него не будут «темным лесом» аллюзии
          Достоевского или символизм храмов.
        </li>
        <li>
          <strong>Развитие общего кругозора.</strong> Выход за рамки узкого
          прагматизма. Ребенок учится понимать этикет, происхождение слов, смысл
          праздников и традиций своей семьи и страны.
        </li>
        <li>
          <strong>Обретение нравственных ориентиров.</strong> Предмет отвечает
          на главные вопросы: «Что такое хорошо и что такое плохо?» с опорой на
          традиционные ценности.
        </li>
        <li>
          <strong>Формирование устойчивости к деструктивному влиянию.</strong>
          Имея твердый внутренний стержень, ребенку легче противостоять вредным
          привычкам и ложным кумирам.
        </li>
      </UIList>
      <p>
        Урок «Основ православной культуры» — это не про религиозное обучение
        (крещение, посты и молитвы как самоцель). Это про нашу великую культуру,
        про язык предков, про нравственное воспитание и поиск правильных
        ориентиров для жизни. Это пространство, где ребенок получает ответы на
        сложные вопросы в безопасной и традиционной системе координат.
      </p>
    </CompetitionSection>
    <OPKMeeting />
    <OPKLessons :addressee="'parents'" />
    <OPKLaws />
  </div>
</template>

<script setup lang="ts">
  const date = new Date();
  const wd = date.setDate(-date.getDay() + 1);

  const menu = [
    {
      name: 'О предмете «Основы Религиозной Культуры и Светской Этики»',
      id: 'about-orkse',
      lvl: 1,
    },
    {
      name: 'Выбор модуля «Основы православной культуры»',
      id: 'about-opk',
      lvl: 1,
    },
    { name: 'Живопись', id: 'about-opk-1', lvl: 2 },
    { name: 'Литература', id: 'about-opk-2', lvl: 2 },
    { name: 'Архитектура', id: 'about-opk-3', lvl: 2 },
    { name: 'Язык и повседневность', id: 'about-opk-4', lvl: 2 },
    {
      name: 'Нравственный ориентир в современном мире',
      id: 'about-opk-5',
      lvl: 2,
    },
    { name: 'Что дает ребенку изучение ОПК?', id: 'about-opk-6', lvl: 2 },

    { name: 'Родительское собрание', id: 'meeting', lvl: 1 },
    { name: '1. Подготовка и содержание собрания', id: 'meeting-1', lvl: 2 },
    {
      name: '2. Процедура выбора и документальное оформление',
      id: 'meeting-2',
      lvl: 2,
    },
    {
      name: '3. Составление итоговых документов класса',
      id: 'meeting-3',
      lvl: 2,
    },
    { name: '4. Утверждение и передача данных', id: 'meeting-4', lvl: 2 },
    { name: 'Дополнительные ресурсы', id: 'meeting-resourses', lvl: 2 },
    { name: 'Материалы к урокам', id: 'lessons', lvl: 1 },
    { name: 'Законодательство', id: 'laws', lvl: 1 },
    { name: 'Федеральный Закон №125, от 26.09.1997', id: 'laws-1', lvl: 2 },
    { name: 'Федеральный Закон №273, от 29.12.2012', id: 'laws-2', lvl: 2 },
    { name: 'Указ Президента РФ №809, от 09.11.2022', id: 'laws-3', lvl: 2 },
    { name: 'Иные документы и дополнительные материалы', id: 'laws-4', lvl: 2 },
  ];
</script>

<style scoped lang="scss"></style>
