<template>
  <div>
    <UIMenu :menu />
    <h2 id="info">
      Патриаршая программа изучения Священного Писания: «Исследуйте Писания»
    </h2>
    <div class="video right">
      <iframe
        src="https://vkvideo.ru/video_ext.php?oid=37237736&id=456240126&hash=296625b55e6ad396&hd=1"
        style="
          width: 700px;
          max-width: 100%;
          height: 400px;
          overflow: hidden;
          border: 4px solid var(--accent);
          border-radius: 10px;
        "
        allow="
          autoplay;
          encrypted-media;
          fullscreen;
          picture-in-picture;
          screen-wake-lock;
        "
        frameborder="0"
        allowfullscreen
      ></iframe>
      <span style="display: block; font-size: 0.8em; text-align: center">
        <strong>Обращение Святейшего Патриарха Кирилла</strong>
        <span style="display: block"
          >к участникам Патриаршей программы изучения Библии</span
        >
      </span>
    </div>
    <p>
      В 2022 году по инициативе Святейшего Патриарха Московского и всея Руси
      Кирилла была запущена
      <strong>Патриаршая программа изучения Библии</strong>. Её главная цель —
      повысить уровень знания Священного Писания среди верующих Русской
      Православной Церкви и помочь каждому приобрести навык толкования
      библейских текстов в соответствии с православной традицией.
    </p>
    <p>
      Центральным элементом программы стал образовательный портал «Исследуйте
      Писания», созданный Синодальным отделом религиозного образования и
      катехизации совместно с Синодальной библейско-богословской комиссией.
      Портал предлагает
      <strong>системное, доступное и бесплатное изучение Библии</strong> для
      всех желающих — от тех, кто только начинает свой путь в вере, до давних
      прихожан, стремящихся углубить свои знания.
    </p>
    <a
      href="https://izuchaem-bibliu.ru/"
      class="organization-competition"
      target="_blank"
      rel="noopener noreferrer"
    >
      <div>Образовательный Портал «Исследуйте Писания»</div>
      <div><NuxtImg src="/logo_scripture_white.png" alt="Пересвет" /></div>
    </a>
    <div class="video">
      <video-player>
        <video-skin>
          <video
            playsinline
            controls
            src="https://s3.regru.cloud/opk-info/videos/Общая информация о ППИП_360p.mp4"
          ></video>
        </video-skin>
      </video-player>
    </div>
    <blockquote>
      «Библия в церковной традиции именуется Словом Божиим. Это означает, что
      <strong>в Священном Писании содержится Истина</strong>, данная самим Богом
      человеку для должного устроения нашей земной жизни. Надеюсь, что
      библейские занятия принесут добрые плоды и будут способствовать духовному
      просвещению, укреплению веры и благочестия наших современников».
      <p style="font-size: 0.8em"><strong>Святейший Патриарх Кирилл</strong></p>
    </blockquote>
    <p>
      Патриаршая программа изучения Священного Писания «Исследуйте Писания» —
      это масштабный просветительский проект, призванный
      <strong>сделать слово Божие доступным и понятным каждому</strong>. Сочетая
      традиции православной просветительской деятельности с современными
      образовательными технологиями, программа открывает новые возможности для
      духовного роста и укрепления веры.
    </p>
    <h2 id="tasks">Задачи проекта</h2>
    <p>
      Программа «Исследуйте Писания» ставит перед собой амбициозную задачу —
      <strong>раскрыть содержание, значимость и красоту текстов Библии</strong>.
      Изучение Священного Писания имеет ключевое значение для духовной жизни
      человека по нескольким причинам:
    </p>
    <UIList>
      <li>
        <strong>Духовное развитие</strong> — правильное понимание Библии
        помогает христианину возрастать в вере и благочестии.
      </li>
      <li>
        <strong>Понимание вероучения</strong> — Священное Писание, являясь
        частью Предания Церкви, лежит в основе всего православного вероучения.
      </li>
      <li>
        <strong>Расширение кругозора</strong> — библейские образы и аллюзии
        пронизывают все сферы человеческой жизни — от искусства до экономики и
        юриспруденции.
      </li>
    </UIList>
    <h2 id="online">Изучение Священного Писания онлайн</h2>
    <p>
      На сегодняшний день на портале представлены следующие
      <strong> онлайн-курсы</strong>:
    </p>
    <UIList :type="'ol'">
      <li>
        <strong>«Библия за год»</strong> — За <strong>40 уроков</strong> вы
        узнаете обо всех основных событиях библейской истории от сотворения мира
        до Апокалипсиса;
      </li>
      <li>
        <strong>«Новый Завет за год»</strong> — За <strong>40 уроков</strong> вы
        узнаете о земном служении и учении Господа нашего Иисуса Христа,
        апостольской проповеди и жизни ранней Церкви;
      </li>
      <li>
        <strong>«Псалтирь в 13 шагах»</strong> — За
        <strong>13 уроков</strong> вы изучите все псалмы, которые входят в
        состав Псалтири - одной из самых непростых для понимания книг Ветхого
        Завета;
      </li>
      <li>
        <strong>«Нагорная проповедь в 10 шагах»</strong> — За
        <strong>10 уроков</strong> вы разберетесь в том, как устроена Нагорная
        проповедь, изучите евангельские заповеди, поймёте их значение и
        контекст;
      </li>
      <li>
        <strong>«Бытие в 15 шагах»</strong> — За <strong>15 уроков</strong> вы
        пройдёте весь путь книги Бытия, научитесь анализировать библейский
        текст, объяснять его смысл и видеть в нём свидетельство о Христе — с
        опорой на святоотеческую традицию;
      </li>
      <li>
        <strong>«Евангельские чтения Страстной седмицы»</strong> — За
        <strong>10 уроков</strong>
        вы изучите евангельские отрывки, читаемые за богослужениями Страстной
        Седмицы в Православной Церкви.
      </li>
    </UIList>
    <a
      href="https://izuchaem-bibliu.ru/courses"
      class="organization-competition"
      target="_blank"
      rel="noopener noreferrer"
    >
      <div>Курсы Портала «Исследуйте Писания»</div>
      <div><NuxtImg src="/logo_scripture_white.png" alt="Пересвет" /></div>
    </a>
    <h2 id="future">Преимущества обучения</h2>
    <p>
      Участники программы получают <strong>уникальные возможности</strong> для
      глубокого и системного изучения Священного Писания:
    </p>
    <UIList>
      <li>
        <strong>Бесплатный доступ</strong> — обучение на любой программе
        абсолютно бесплатно, доступ к материалам остаётся навсегда;
      </li>
      <li>
        <strong>Индивидуальный подход</strong> — изучайте Писание когда и где
        вам удобно;
      </li>
      <li>
        <strong>Гибкая программа</strong> — проходите занятия в комфортном для
        вас темпе и ритме;
      </li>
      <li>
        <strong>Системная подача</strong> — курсы разделены на модули для
        удобного восприятия информации;
      </li>
      <li>
        <strong>Готовые конспекты</strong> — к каждому занятию приложен конспект
        материала;
      </li>
      <li>
        <strong>Самопроверка</strong> — тесты помогают понять, готовы ли вы
        перейти к следующему занятию;
      </li>
      <li>
        <strong>Сообщество единомышленников</strong> — доступ в закрытый чат
        курса для общения;
      </li>
      <li>
        <strong>Сертификат</strong> — по окончании курса и успешном прохождении
        тестирования выдаётся сертификат.
      </li>
    </UIList>

    <h2 id="registry">Приходские библейские группы</h2>
    <p>
      Важным направлением Программы является организация и развитие приходских
      библейских групп. В Горловской Епархии действуют несколько библейских
      групп (воскресных школ для взрослых). Каждый желающий может прийти и
      изучать Священное Писание в живом общении со священником и другими
      участниками групп.
    </p>
    <WidgetsScriptureList />
  </div>
</template>

<script setup lang="ts">
  const menu = [
    { name: 'Информация о программе', id: 'info', lvl: 1 },
    { name: 'Задачи проекта', id: 'tasks', lvl: 1 },
    { name: 'Онлайн курсы', id: 'online', lvl: 1 },
    { name: 'Преимущества обучения', id: 'future', lvl: 1 },
    { name: 'Реестр библейских групп', id: 'registry', lvl: 1 },
  ];
</script>

<style scoped lang="scss">
  .right {
    float: right;
    margin: 0 0.5em 0.5em 1.5em;
  }

  @media (width <= 768px) {
    .right {
      float: none;
      margin: 0 0 1em;
    }
  }
</style>
