<template>
  <div>
    <UIMenu :menu />
    <h2>УВАЖАЕМЫЕ ПЕДАГОГИ, РОДИТЕЛИ И ДЕТИ!</h2>
    <CompetitionSection>
      <p>
        Отдел религиозного образования и катехизации Горловской епархии
        приглашает Вас принять участие в XIII сезоне Международного
        детско-юношеского литературного конкурса имени И.С. Шмелева «Лето
        Господне».
      </p>
      <p><strong>Организаторы конкурса:</strong></p>
      <UIList>
        <li>Издательский совет Русской Православной Церкви;</li>
        <li>
          АНО Центр духовно-просветительских программ имени святителя Филарета
          Московского.
        </li>
      </UIList>
      <p>
        Конкурс проводится в два этапа. Первый (заочный) этап — приём творческих
        работ осуществляется дистанционно (на сайте конкурса, ссылка ниже).
        Второй (очный) этап — в дни весенних школьных каникул в Москве. На
        второй (очный) этап в дни весенних школьных каникул в Москву
        приглашаются участники от каждой возрастной группы, набравших наибольшее
        количество баллов. Финалисты пишут итоговую работу на предложенную тему,
        по результатам которой будут названы призеры конкурса.
      </p>
      <p>
        Отдел Религиозного Образования и Катехизации Горловской Епархии не
        проводит независимого оценивания конкурсных работ! Отбор финалистов
        осуществляется Отборочной комиссией, формируемой Издательским Советом
      </p>
      <p>
        Образовательные учреждения и педагоги, подготовившие победителей,
        занявших 1-е место в каждой из трех групп, награждаются дипломами и
        специальными призами. Творческие работы победителей и финалистов
        публикуются на сайте Конкурса, в литературных журналах, в средствах
        массовой информации и отдельных сборниках произведений.
      </p>
      <a
        href="https://letogospodne.ru/"
        class="organization-competition"
        target="_blank"
        rel="noopener noreferrer"
      >
        <div>Сайт Конкурса:</div>
        <div>
          <NuxtImg
            src="/logo_summer_original.svg"
            class="original-logo"
            alt="Международный детско-юношеский литературный конкурс имени И.С. Шмелева «Лето Господне»"
          />
        </div>
      </a>
      <h3 id="info-1">
        XIII сезон Конкурса проводится
        <strong>с 1 сентября по 10 декабря 2026 года</strong>, принять участие в
        нем могут <strong>учащиеся 6–11 классов</strong>.
      </h3>

      <h3 id="info-2"><strong>Цели и задачи</strong> Конкурса:</h3>
      <UIList>
        <li>
          развитие творческого потенциала подрастающего поколения на основе
          духовной традиции отечественной культуры;
        </li>
        <li>развитие культуры чтения и интереса к русской литературе;</li>
        <li>
          популяризация творчества писателей, следующих духовной традиции
          отечественной культуры;
        </li>
        <li>
          содействие формированию у юных писателей творческих навыков,
          направленных на сохранение и развитие лучших традиций русской
          литературы;
        </li>
        <li>поддержка одаренных, творчески мыслящих детей и подростков;</li>
        <li>развитие творческого потенциала участников Конкурса;</li>
        <li>
          популяризация русского языкового и литературного наследия в России, а
          также странах ближнего и дальнего зарубежья;
        </li>
        <li>
          содействие приобщению детей и подростков к православной культуре и
          традициям Церкви.
        </li>
      </UIList>

      <h3 id="info-3">
        Конкурс проводится в следующих
        <strong>возрастных группах</strong>:
      </h3>
      <UIList>
        <li>6–7 классы;</li>
        <li>8–9 классы;</li>
        <li>10–11 классы.</li>
      </UIList>
      <h3 id="info-4"><strong>Требования к работам:</strong></h3>
      <UIList>
        <li>
          <strong>Объём работы</strong> — не менее 5 000 (3 страницы формата А4)
          и не более 20 000 (не более 12 страниц А4) знаков c пробелами;
        </li>
        <li><strong>Формат подачи</strong> — *.doc, *.docx;</li>
        <li>
          <strong>Шрифт</strong> — Times New Roman, <strong>кегль</strong> —
          14pt, <strong>междустрочный интервал</strong> — 1,5;
        </li>
        <li>
          Оформление работы должно
          <strong>строго соответствовать требованиям</strong>, изложенным в
          официальном Положении о Конкурсе, размещённом на сайте
          <a href="https://letogospodne.ru/info/polozhenie/" target="_blank"
            >https://letogospodne.ru/info/polozhenie/</a
          >.
        </li>
      </UIList>
      <h3 id="info-5">
        <strong>Тематические направления и жанры работ</strong>
      </h3>
      <p>
        Участникам предлагается написать работу по одному из тематических
        направлений и в одном из жанров. По любому из направлений тема может
        быть сформулирована автором самостоятельно (примеры тем приведены ниже).
      </p>

      <p>
        <strong>Тематические направления и примеры тем:</strong>
      </p>
      <UIList>
        <li>
          <strong
            >Священное Евангелие как основание русской литературы. —</strong
          >
          Образ Евангелия в творчестве русских писателей. Евангельские мотивы в
          классических произведениях. Стихотворное переложение псалмов в русской
          поэзии. История Церкви и жития святых как основа для литературного
          творчества. Заповеди блаженства в литературных произведениях.
        </li>
        <li>
          <strong
            >«Нет больше той любви, как если кто положит душу свою за друзей
            своих». Подвиг любви и веры. —</strong
          >
          Понимание подвига в произведениях русских писателей. Святые князья
          Борис и Глеб, князь Михаил и боярин Феодор Черниговские –
          страстотерпцы Святой Руси. Традиции русского воинства и память святого
          князя Александра Невского. Подвиг в тылу и на фронте в произведениях о
          Великой Отечественной войне. Подвиг материнства. Новомученики и
          исповедники Русской Церкви – страдальцы за веру и правду. Герой нашего
          времени – размышления о подвиге современников.
        </li>
        <li>
          <strong
            >«Человек заслуживает свое счастье, и всегда страданием». К
            160-летию создания Ф.М. Достоевским романа «Преступление и
            наказание». —</strong
          >
          Жизненный путь Ф.М. Достоевского и замысел романа «Преступление и
          наказание». Евангельские смыслы и образы в романе «Преступление и
          наказание». Идея «сверхчеловека», тема духовного возрождения и их
          отображение в героях романа. Санкт-Петербург в романе «Преступление и
          наказание». Картина мира Ф.М. Достоевского в сюжетах и образах романа
          «Преступление и наказание». Два героя романа – Раскольников и
          Свидригайлов, их единство и противоположность. «Преступление и
          наказание» как отправная точка «Великого пятикнижия» романов Ф.М.
          Достоевского.
        </li>
        <li>
          <strong
            >«Царствие Божие – это тихое, мирное, незаметное вхождение Духа
            Святого в сердца человеческие» К 150-летию со дня рождения святителя
            Луки Крымского. —</strong
          >
          Пастырь, ученый, святой – жизненный путь и пример служения
          архиепископа Луки. Служение будущего епископа земским доктором в
          Переславле-Залесском. Трагедия семьи и путь к священству святителя
          Луки. Тюрьмы, лагеря и ссылки – святитель Лука как один из
          новомучеников и исповедников Церкви Русской. Основоположник гнойной
          хирургии – врач и выдающийся ученый, лауреат Сталинской премии епископ
          Лука. Служение святителя Луки на Тамбовской и Крымской земле, его
          проповеди и наставления.
        </li>
        <li>
          <strong
            >«Без дела, без того, чтобы в нём нуждались, человек жить не может».
            К 90-летию со дня рождения писателя Валентина Григорьевича
            Распутина. —</strong
          >
          Русское содержание «Уроков французского». Деревня в творчестве В.Г.
          Распутина – умирающая, но не сдающаяся. Совесть и правда. Мудрость
          доброты. Размышления о силе русского слова. Писатели-почвенники как
          авангард духовного возрождения России. Духовное осмысление событий
          современности. Сила правды и памяти.
        </li>
        <li>
          <strong
            >«Поистине, то был Золотой век нашей литературы, период её
            невинности и блаженства!» М.А. Антонович. Поэзия и проза XIX
            столетия. —</strong
          >
          Формирование русского литературного языка в начале XIX столетия.
          Романтизм, место человека и духовные искания в русской поэзии XIX в.
          Духовное начало в русской поэзии Золотого века. Новые герои русской
          литературы XIX столетия. Развитие отечественной драматургии. Русская
          проза XIX столетия как отражение общественной мысли. Психологический
          роман, как новая форма русской литературы, прославившая ее в мировом
          искусстве. Духовные писатели св. Феофан Затворник, свт. Игнатий
          (Брянчанинов), свт. Иннокентий (Вениаминов), св. Филарет Московский и
          другие представители духовного жанра XIX столетия в их влиянии на
          русскую словесность.
        </li>
      </UIList>
      <p><strong>Примерные жанры конкурсных работ:</strong></p>
      <UIList>
        <li>Рассказ;</li>
        <li>Литературно-критическая статья;</li>
        <li>Эссе;</li>
        <li>Очерк;</li>
        <li>Дневник;</li>
        <li>Путешествие;</li>
        <li>Сочинение-описание;</li>
        <li>Сочинение-повествование;</li>
        <li>Сочинение-рассуждение.</li>
      </UIList>

      <p>
        Другие жанры могут быть выбраны автором самостоятельно. Выбранные жанр и
        тема конкурсной работы указываются при заполнении анкеты участника.
        Раскрытие темы и соответствие выбранному жанру творческой работы
        учитывается при оценке работ Экспертным советом.
      </p>
      <p>
        С подробным описанием тематических направлений и жанров можно
        ознакомится на сайте Организаторов Конкурса (<a
          href="https://letogospodne.ru/info/polozhenie/"
          target="_blank"
          >https://letogospodne.ru/info/polozhenie/</a
        >)
      </p>
    </CompetitionSection>
  </div>
</template>

<script setup lang="ts">
  const menu = [
    { name: 'Сроки проведения', id: 'info-1', lvl: 1 },
    { name: 'Цели и задачи', id: 'info-2', lvl: 1 },
    { name: 'Возрастные группы', id: 'info-3', lvl: 1 },
    { name: 'Требования к работам', id: 'info-4', lvl: 1 },
    { name: 'Тематические направления и жанры', id: 'info-5', lvl: 1 },
  ];
</script>

<style scoped lang="scss">
  .original-logo {
    max-width: 300px;
    max-height: 300px;
  }
</style>
