<template>
  <div>
    <UIMenu :menu />
    <h2 id="info">УВАЖАЕМЫЕ ПЕДАГОГИ, РОДИТЕЛИ И ДЕТИ!</h2>
    <CompetitionSection>
      <p>
        Отдел религиозного образования и катехизации Горловской епархии
        приглашает Вас принять участие в XIII сезоне Международного
        детско-юношеского литературного конкурса имени И.С. Шмелева «Лето
        Господне».
      </p>
      <p><strong>Организаторы конкурса:</strong></p>
      <UIList>
        <li>Издательский совет Русской Православной Церкви;</li>
        <li>
          АНО Центр духовно-просветительских программ имени святителя Филарета
          Московского.
        </li>
      </UIList>
      <p>
        Конкурс проводится в два этапа. Первый (заочный) этап — приём творческих
        работ осуществляется дистанционно (на нашем сайте внизу страницы).
        Второй (очный) этап — в дни весенних школьных каникул в Москве. На
        второй (очный) этап в дни весенних школьных каникул в Москву
        приглашаются участники от каждой возрастной группы, набравших наибольшее
        количество баллов. Финалисты пишут итоговую работу на предложенную тему,
        по результатам которой будут названы призеры конкурса. Транспортные
        расходы и расходы, связанные с проживанием финалистов Конкурса и одного
        сопровождающего лица для каждого участника заключительного этапа,
        оплачиваются Учредителем Конкурса (Издательским Советом РПЦ).
      </p>
      <p>
        Отдел Религиозного Образования и Катехизации Горловской Епархии не
        проводит независимого оценивания конкурсных работ! Отбор финалистов
        осуществляется Отборочной комиссией, формируемой Издательским Советом
      </p>
      <p>
        Все участники Конкурса от Горловской Епархии получат Сертификаты
        Участников. Победители Конкурса награждаются дипломами первой, второй и
        третьей степени и ценными призами. Образовательные учреждения и
        педагоги, подготовившие победителей, занявших 1-е место в каждой из трех
        групп, награждаются дипломами и специальными призами. Творческие работы
        победителей и финалистов публикуются на сайте Конкурса, в литературных
        журналах, в средствах массовой информации и отдельных сборниках
        произведений.
      </p>
      <a
        href="https://letogospodne.ru/"
        class="organization-competition"
        target="_blank"
        rel="noopener noreferrer"
      >
        <div>Сайт Конкурса:</div>
        <div>
          <NuxtImg
            src="/logo_summer_original.svg"
            class="original-logo"
            alt="Международный детско-юношеский литературный конкурс имени И.С. Шмелева «Лето Господне»"
          />
        </div>
      </a>
      <h3 id="info-1">
        XIII сезон Конкурса проводится
        <strong>с 1 сентября по 10 ноября 2026 года</strong>, принять участие в
        нем могут <strong>учащиеся 6–11 классов</strong>:
      </h3>
      <UIList>
        <li>образовательных и профессиональных образовательных организаций;</li>
        <li>организаций дополнительного образования;</li>
        <li>воскресных школ;</li>
        <li>
          воспитанники иных детских и образовательных учреждений на территории
          Горловской епархии.
        </li>
      </UIList>

      <h3 id="info-2"><strong>Цели и задачи</strong> Конкурса:</h3>
      <UIList>
        <li>
          развитие творческого потенциала подрастающего поколения на основе
          духовной традиции отечественной культуры;
        </li>
        <li>развитие культуры чтения и интереса к русской литературе;</li>
        <li>
          популяризация творчества писателей, следующих духовной традиции
          отечественной культуры;
        </li>
        <li>
          содействие формированию у юных писателей творческих навыков,
          направленных на сохранение и развитие лучших традиций русской
          литературы;
        </li>
        <li>поддержка одаренных, творчески мыслящих детей и подростков;</li>
        <li>развитие творческого потенциала участников Конкурса;</li>
        <li>
          популяризация русского языкового и литературного наследия в России, а
          также странах ближнего и дальнего зарубежья;
        </li>
        <li>
          содействие приобщению детей и подростков к православной культуре и
          традициям Церкви.
        </li>
      </UIList>

      <h3 id="info-3">
        Конкурс проводится в следующих
        <strong>возрастных группах</strong>:
      </h3>
      <UIList>
        <li>6–7 классы;</li>
        <li>8–9 классы;</li>
        <li>10–11 классы.</li>
      </UIList>
      <h3 id="info-4"><strong>Требования к работам:</strong></h3>
      <UIList>
        <li>
          Работы принимаются <strong>в электронном виде</strong>, через подачу
          заявки внизу страницы;
        </li>
        <li>
          <strong>Объём работы</strong> — не менее 5 000 (3 страницы формата А4)
          и не более 20 000 (не более 12 страниц А4) знаков c пробелами;
        </li>
        <li><strong>Формат подачи</strong> — *.doc, *.docx;</li>
        <li>
          <strong>Шрифт</strong> — Times New Roman, <strong>кегль</strong> —
          14pt, <strong>междустрочный интервал</strong> — 1,5;
        </li>
        <li>
          Оформление работы должно
          <strong>строго соответствовать требованиям</strong>, изложенным в
          официальном Положении о Конкурсе, размещённом на сайте
          <a href="https://letogospodne.ru/info/polozhenie/" target="_blank"
            >https://letogospodne.ru/info/polozhenie/</a
          >.
        </li>
      </UIList>
      <h3 id="info-5">
        <strong>Тематические направления и жанры работ</strong>
      </h3>
      <p>
        Участникам предлагается написать работу по одному из тематических
        направлений и в одном из жанров. По любому из направлений тема может
        быть сформулирована автором самостоятельно (примеры тем приведены ниже).
      </p>

      <p>
        <strong>Тематические направления и примеры тем:</strong>
      </p>
      <UIList>
        <li>
          <strong
            >Священное Евангелие как основание русской литературы. —</strong
          >
          Образ Евангелия в творчестве русских писателей. Евангельские мотивы в
          классических произведениях. Стихотворное переложение псалмов в русской
          поэзии. История Церкви и жития святых как основа для литературного
          творчества. Заповеди блаженства в литературных произведениях.
        </li>
        <li>
          <strong
            >«Нет больше той любви, как если кто положит душу свою за друзей
            своих». Подвиг любви и веры. —</strong
          >
          Понимание подвига в произведениях русских писателей. Святые князья
          Борис и Глеб, князь Михаил и боярин Феодор Черниговские –
          страстотерпцы Святой Руси. Традиции русского воинства и память святого
          князя Александра Невского. Подвиг в тылу и на фронте в произведениях о
          Великой Отечественной войне. Подвиг материнства. Новомученики и
          исповедники Русской Церкви – страдальцы за веру и правду. Герой нашего
          времени – размышления о подвиге современников.
        </li>
        <li>
          <strong
            >«Побеждайте зло добром!» К 100-летию преставления святителя Тихона,
            Патриарха Московского и всея России. —</strong
          >
          Детство и юность будущего Патриарха Тихона. Образ доброго пастыря:
          богобоязненность, мудрость, твердость в вере, великодушие и смирение.
          Святитель Тихон в воспоминаниях современников. Патриарх Московский и
          всея России Тихон и начало эпохи новомучеников Церкви Русской.
          Послания Патриарха Тихона, как пример пастырского мужества и образец
          духовного назидания в огненную пору. Память о святителе Тихоне в наши
          дни.
        </li>
        <li>
          <strong
            >«Помните! Через века, через года, — помните! О тех, кто уже не
            придет никогда, — помните!» Р. Рождественский. К 80-летию Победы в
            Великой Отечественной войне. —</strong
          >
          Творчество писателей-фронтовиков К. Симонова, Ю. Бондарева, Б.
          Васильева и других. Тема подвига и верности долгу в произведениях о
          Великой Отечественной войне. Юные герои Великой Отечественной войны.
          Память о войне в моей семье. «Стоя на месте великих боёв» – личные
          впечатления от поездок на места боевой славы. Подвиг
          священнослужителей в годы Великой Отечественной войны. Жизнь и смерть:
          размышления о судьбах фронтовиков. «Чтобы помнили» – рассказы из жизни
          поисковых отрядов.
        </li>
        <li>
          <strong
            >«Паче всего люби родную литературу, и звание литератора предпочитай
            всякому другому». К 200-летию со дня рождения Михаила Евграфовича
            Салтыкова-Щедрина. —</strong
          >
          Образы русской жизни в произведениях М.Е. Салтыкова-Щедрина. «История
          одного города» – острая сатира и сердечная боль о России. Образы
          греховных страстей и торжество совести в героях «Господ Головлевых»
          М.Е. Салтыкова-Щедрина. Назидательный смысл сказок М.Е.
          Салтыкова-Щедрина. Самобытность литературного языка в произведениях
          М.Е. Салтыкова-Щедрина. Евангельские истоки сатиры М.Е.
          Салтыкова-Щедрина.
        </li>
        <li>
          <strong
            >«Поистине, то был Золотой век нашей литературы, период её
            невинности и блаженства!» М.А. Антонович. Поэзия и проза XIX
            столетия. —</strong
          >
          Формирование русского литературного языка в начале XIX столетия.
          Романтизм, место человека и духовные искания в русской поэзии XIX в.
          Духовное начало в русской поэзии Золотого века. Новые герои русской
          литературы XIX столетия. Развитие отечественной драматургии. Русская
          проза XIX столетия как отражение общественной мысли. Психологический
          роман, как новая форма русской литературы, прославившая ее в мировом
          искусстве. Духовные писатели св. Феофан Затворник, свт. Игнатий
          (Брянчанинов), свт. Иннокентий (Вениаминов), св. Филарет Московский и
          другие представители духовного жанра XIX столетия в их влиянии на
          русскую словесность.
        </li>
      </UIList>
      <p><strong>Примерные жанры конкурсных работ:</strong></p>
      <UIList>
        <li>Рассказ;</li>
        <li>Литературно-критическая статья;</li>
        <li>Эссе;</li>
        <li>Очерк;</li>
        <li>Дневник;</li>
        <li>Путешествие;</li>
        <li>Сочинение-описание;</li>
        <li>Сочинение-повествование;</li>
        <li>Сочинение-рассуждение.</li>
      </UIList>

      <p>
        Другие жанры могут быть выбраны автором самостоятельно. Выбранные жанр и
        тема конкурсной работы указываются при заполнении анкеты участника.
        Раскрытие темы и соответствие выбранному жанру творческой работы
        учитывается при оценке работ Экспертным советом.
      </p>
      <p>
        С подробным описанием тематических направлений и жанров можно
        ознакомится на сайте Организаторов Конкурса (<a
          href="https://letogospodne.ru/info/polozhenie/"
          target="_blank"
          >https://letogospodne.ru/info/polozhenie/</a
        >)
      </p>

      <h3 id="info-6">
        <strong>По всем возникающим вопросам обращаться:</strong>
      </h3>
      <p>
        Протоиерей Кирилл Щевелев, руководитель Отдела религиозного образования
        и катехизации Горловской епархии:
      </p>

      <UIList>
        <li>
          <strong>Телефон: </strong>
          <a href="tel:79495208117">+7 (949) 520-81-17</a>
        </li>
        <li>
          <strong>E-mail: </strong>
          <a href="mailto:MGD.Kirill.Sch@yandex.ru">MGD.Kirill.Sch@yandex.ru</a>
        </li>
      </UIList>
    </CompetitionSection>

    <CompetitionSection>
      <h2 id="docs">Документы для конкурса</h2>
      <UIDocumentWrap>
        <UIDocumentCard
          v-for="doc in docs"
          :key="doc.href"
          :size="doc.size"
          :href="doc.href"
          >{{ doc.name }}</UIDocumentCard
        >
      </UIDocumentWrap>
    </CompetitionSection>

    <CompetitionSection>
      <h2 id="order">Подать заявку</h2>
      <p><strong>Для участия в конкурсе необходимо:</strong></p>
      <UIList :type="'ul'">
        <li>
          Ознакомиться с
          <a href="#docs">документами конкурса</a>,
          <a href="#info-5">тематическими направлениями, жанрами</a>,
          <a href="#info-3">возрастными группами</a>, а также
          <a href="#info-4">требованиями к работам</a>;
        </li>
        <li>Выбрать тему, написать работу, оформить согласно требованиям;</li>
        <li>
          Заполнить и подать заявку (для каждой работы новая заявка) на участие
          в конкурсе (ниже) и прикрепить к заявке файл с работой;
        </li>
        <li>
          При наличии ошибок в оформлении, ожидать звонка на указанный контакт
          (мы поможем оформить работу под указанные требования);
        </li>
        <li>Ожидать результаты первого этапа;</li>
        <li>
          Победители первого этапа от Горловской Епархии будут опубликованы на
          этом сайте, а также в TG и канале МАКС Горловской Епархии.
        </li>
      </UIList>

      <div
        class="order__disabled"
        v-if="dateCurrent && dateCurrent < dateStart"
      >
        Приём заявок начнётся: {{ dateStart.toLocaleDateString() }}
      </div>
      <div
        class="order__new"
        @click="isOpenPopupOrder = true"
        v-if="dateCurrent && dateCurrent >= dateStart && dateCurrent <= dateEnd"
      >
        Подать заявку
      </div>
      <div class="order__disabled" v-if="dateCurrent && dateCurrent > dateEnd">
        Приём заявок завершился {{ dateEnd.toLocaleDateString() }}
      </div>
    </CompetitionSection>

    <Teleport to="body">
      <WidgetsFormsBeauty2026
        v-if="isOpenPopupOrder"
        @close-popup="isOpenPopupOrder = false"
      />
    </Teleport>
  </div>
</template>

<script setup lang="ts">
  interface IDoc {
    size?: string | null;
    href: string;
    name: string;
  }

  // Даты конкурса (при необходимости скорректировать)
  const dateStart = new Date(2025, 8, 1);
  const dateEnd = new Date(2026, 9, 31);

  const dateCurrent = ref<Date | null>(null);
  onMounted(() => {
    dateCurrent.value = new Date();
  });

  // --- Остальные данные ---
  const isOpenPopupOrder = ref(false);

  const docs: Array<IDoc> = [
    {
      size: '3.06 Mb',
      href: `https://s3.regru.cloud/opk-info/beauty-of-gods-world/XXI/docs/01_Положение о конкурсе 'Красота Божьего мира'.pdf`,
      name: `Положение организации участия`,
    },
    {
      size: '2.80 Mb',
      href: `https://s3.regru.cloud/opk-info/beauty-of-gods-world/XXI/docs/01_Положение регионального этапа о конкурсе.pdf`,
      name: `Тематические направления и жанры работ`,
    },
    {
      size: '3.37 Mb',
      href: `https://s3.regru.cloud/opk-info/beauty-of-gods-world/XXI/docs/03_Требования к работам.pdf`,
      name: `Требования к работам и подача заявки`,
    },
  ];

  const menu = [
    { name: 'Информация о конкурсе', id: 'info', lvl: 1 },
    { name: 'Сроки проведения', id: 'info-1', lvl: 2 },
    { name: 'Цели и задачи', id: 'info-2', lvl: 2 },
    { name: 'Возрастные группы', id: 'info-3', lvl: 2 },
    { name: 'Требования к работам', id: 'info-4', lvl: 2 },
    { name: 'Тематические направления и жанры', id: 'info-5', lvl: 2 },
    { name: 'Контакты', id: 'info-6', lvl: 2 },
    { name: 'Документы для конкурса', id: 'docs', lvl: 1 },
    { name: 'Подать заявку', id: 'order', lvl: 1 },
  ];
</script>

<style scoped lang="scss">
  .order {
    &__new,
    &__disabled {
      display: flex;
      align-items: center;
      justify-content: center;
      width: 50%;
      min-width: 300px;
      height: 100px;
      margin: 30px auto;
      font-weight: 600;
      text-align: center;
      text-transform: uppercase;
      border: 5px solid var(--accent);
    }
    &__new {
      color: var(--accent);
      font-size: 1.6em;
      cursor: pointer;
      transition: 0.3s ease-in-out;
      &:hover {
        color: var(--color-white);
        background: var(--accent);
      }
    }
    &__disabled {
      color: grey;
      border-color: grey;
    }
  }
  .original-logo {
    max-width: 300px;
    max-height: 300px;
  }
</style>
